tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1713_tdd.h
#define WPUC5                         522
#define WPUC6                         523
#define WPUC7                         524
#define WPUE                          525
#define WPUE3                         526
#define SSP1BUF                       527
#define BUF                           528
#define BUF0                          529
#define SSP1BUF0                      530
#define BUF1                          531
#define SSP1BUF1                      532
#define BUF2                          533
#define SSP1BUF2                      534
#define BUF3                          535
#define SSP1BUF3                      536
#define BUF4                          537
#define SSP1BUF4                      538
#define BUF5                          539
#define SSP1BUF5                      540
#define BUF6                          541
#define SSP1BUF6                      542
#define BUF7                          543
#define SSP1BUF7                      544
#define ADD0                          545
#define ADD                           546
#define SSP1ADD0                      547
#define SSP1ADD                       548
#define ADD1                          549
#define SSP1ADD1                      550
#define ADD2                          551
#define SSP1ADD2                      552
#define ADD3                          553
#define SSP1ADD3                      554
#define ADD4                          555
#define SSP1ADD4                      556
#define ADD5                          557
#define SSP1ADD5                      558
#define ADD6                          559
#define SSP1ADD6                      560
#define ADD7                          561
#define SSP1ADD7                      562
#define SSP1MSK0                      563
#define SSP1MSK                       564
#define MSK0                          565
#define MSK                           566
#define SSP1MSK1                      567
#define MSK1                          568
#define SSP1MSK2                      569
#define MSK2                          570
#define SSP1MSK3                      571
#define MSK3                          572
#define SSP1MSK4                      573
#define MSK4                          574
#define SSP1MSK5                      575
#define MSK5                          576
#define SSP1MSK6                      577
#define MSK6                          578
#define SSP1MSK7                      579
#define MSK7                          580
#define SSP1STAT                      581
#define BF                            582
#define UA                            583
#define R_nW                          584
#define S                             585
#define P                             586
#define D_nA                          587
#define CKE                           588
#define SMP                           589
#define SSP1CON1                      590
#define SSPM0                         591
#define SSPM                          592
#define SSPM1                         593
#define SSPM2                         594
#define SSPM3                         595
#define CKP                           596
#define SSPEN                         597
#define SSPOV                         598
#define WCOL                          599
#define SSP1CON2                      600
#define SEN                           601
#define RSEN                          602
#define PEN                           603
#define RCEN                          604
#define ACKEN                         605
#define ACKDT                         606
#define ACKSTAT                       607
#define GCEN                          608
#define SSP1CON3                      609
#define DHEN                          610
#define AHEN                          611
#define SBCDE                         612
#define SDAHT                         613
#define BOEN                          614
#define SCIE                          615
#define PCIE                          616
#define ACKTIM                        617
#define ODCONA                        618
#define ODA0                          619
#define ODA1                          620
#define ODA2                          621
#define ODA3                          622
#define ODA4                          623
#define ODA5                          624
#define ODA6                          625
#define ODA7                          626
#define ODCONB                        627
#define ODB0                          628
#define ODB1                          629
#define ODB2                          630
#define ODB3                          631
#define ODB4                          632
#define ODB5                          633
#define ODB6                          634
#define ODB7                          635
#define ODCONC                        636
#define ODC0                          637
#define ODC1                          638
#define ODC2                          639
#define ODC3                          640
#define ODC4                          641
#define ODC5                          642
#define ODC6                          643
#define ODC7                          644
#define CCPR1L                        645
#define CCPR1H                        646
#define CCP1CON                       647
#define CCP1M0                        648
#define CCP1M                         649
#define CCP1M1                        650
#define CCP1M2                        651
#define CCP1M3                        652
#define CCP1Y                         653
#define DC1B                          654
#define DC1B0                         655
#define CCP1X                         656
#define DC1B1                         657
#define CCPR2L                        658
#define CCPR2H                        659
#define CCP2CON                       660
#define CCP2M                         661
#define CCP2M0                        662
#define CCP2M1                        663
#define CCP2M2                        664
#define CCP2M3                        665
#define DC2B0                         666
#define CCP2Y                         667
#define DC2B                          668
#define DC2B1                         669
#define CCP2X                         670
#define CCPTMRS                       671
#define C1TSEL0                       672
#define C1TSEL                        673
#define C1TSEL1                       674
#define C2TSEL0                       675
#define C2TSEL                        676
#define C2TSEL1                       677
#define P3TSEL                        678
#define P3TSEL0                       679
#define P3TSEL1                       680
#define P4TSEL0                       681
#define P4TSEL                        682
#define P4TSEL1                       683
#define SLRCONA                       684
#define SLRA0                         685
#define SLRA1                         686
#define SLRA2                         687
#define SLRA3                         688
#define SLRA4                         689
#define SLRA5                         690
#define SLRA6                         691
#define SLRA7                         692
#define SLRCONB                       693
#define SLRB0                         694
#define SLRB1                         695
#define SLRB2                         696
#define SLRB3                         697
#define SLRB4                         698
#define SLRB5                         699
#define SLRB6                         700
#define SLRB7                         701
#define SLRCONC                       702
#define SLRC0                         703
#define SLRC1                         704
#define SLRC2                         705
#define SLRC3                         706
#define SLRC4                         707
#define SLRC5                         708
#define SLRC6                         709
#define SLRC7                         710
#define INLVLA                        711
#define INLVLA0                       712
#define INLVLA1                       713
#define INLVLA2                       714
#define INLVLA3                       715
#define INLVLA4                       716
#define INLVLA5                       717
#define INLVLA6                       718
#define INLVLA7                       719
#define INLVLB                        720
#define INLVLB0                       721
#define INLVLB1                       722
#define INLVLB2                       723
#define INLVLB3                       724
#define INLVLB4                       725
#define INLVLB5                       726
#define INLVLB6                       727
#define INLVLB7                       728
#define INLVLC                        729
#define INLVLC0                       730
#define INLVLC1                       731
#define INLVLC2                       732
#define INLVLC3                       733
#define INLVLC4                       734
#define INLVLC5                       735
#define INLVLC6                       736
#define INLVLC7                       737
#define INLVLE                        738
#define INLVLE3                       739
#define IOCAP                         740
#define IOCAP0                        741
#define IOCAP1                        742
#define IOCAP2                        743
#define IOCAP3                        744
#define IOCAP4                        745
#define IOCAP5                        746
#define IOCAP6                        747
#define IOCAP7                        748
#define IOCAN                         749
#define IOCAN0                        750
#define IOCAN1                        751
#define IOCAN2                        752
#define IOCAN3                        753
#define IOCAN4                        754
#define IOCAN5                        755
#define IOCAN6                        756
#define IOCAN7                        757
#define IOCAF                         758
#define IOCAF0                        759
#define IOCAF1                        760
#define IOCAF2                        761
#define IOCAF3                        762
#define IOCAF4                        763
#define IOCAF5                        764
#define IOCAF6                        765
#define IOCAF7                        766
#define IOCBP                         767
#define IOCBP0                        768
#define IOCBP1                        769
#define IOCBP2                        770
#define IOCBP3                        771
#define IOCBP4                        772
#define IOCBP5                        773
#define IOCBP6                        774
#define IOCBP7                        775
#define IOCBN                         776
#define IOCBN0                        777
#define IOCBN1                        778
#define IOCBN2                        779
#define IOCBN3                        780
#define IOCBN4                        781
#define IOCBN5                        782
#define IOCBN6                        783
#define IOCBN7                        784
#define IOCBF                         785
#define IOCBF0                        786
#define IOCBF1                        787
#define IOCBF2                        788
#define IOCBF3                        789
#define IOCBF4                        790
#define IOCBF5                        791
#define IOCBF6                        792
#define IOCBF7                        793
#define IOCCP                         794
#define IOCCP0                        795
#define IOCCP1                        796
#define IOCCP2                        797
#define IOCCP3                        798
#define IOCCP4                        799
#define IOCCP5                        800
#define IOCCP6                        801
#define IOCCP7                        802
#define IOCCN                         803
#define IOCCN0                        804
#define IOCCN1                        805
#define IOCCN2                        806
#define IOCCN3                        807
#define IOCCN4                        808
#define IOCCN5                        809
#define IOCCN6                        810
#define IOCCN7                        811
#define IOCCF                         812
#define IOCCF0                        813
#define IOCCF1                        814
#define IOCCF2                        815
#define IOCCF3                        816
#define IOCCF4                        817
#define IOCCF5                        818
#define IOCCF6                        819
#define IOCCF7                        820
#define IOCEP                         821
#define IOCEP3                        822
#define IOCEN                         823
#define IOCEN3                        824
#define IOCEF                         825
#define IOCEF3                        826
#define TMR4                          827
#define PR4                           828
#define T4CON                         829
#define T4CKPS0                       830
#define T4CKPS                        831
#define T4CKPS1                       832
#define TMR4ON                        833
#define T4OUTPS                       834
#define T4OUTPS0                      835
#define T4OUTPS1                      836
#define T4OUTPS2                      837
#define T4OUTPS3                      838
#define TMR6                          839
#define PR6                           840
#define T6CON                         841
#define T6CKPS0                       842
#define T6CKPS                        843
#define T6CKPS1                       844
#define TMR6ON                        845
#define T6OUTPS0                      846
#define T6OUTPS                       847
#define T6OUTPS1                      848
#define T6OUTPS2                      849
#define T6OUTPS3                      850
#define NCO1ACCL                      851
#define NCO1ACCL_NCO1ACC              852
#define NCO1ACC0                      853
#define NCO1ACC1                      854
#define NCO1ACC2                      855
#define NCO1ACC3                      856
#define NCO1ACC4                      857
#define NCO1ACC5                      858
#define NCO1ACC6                      859
#define NCO1ACC7                      860
#define NCO1ACCH                      861
#define NCO1ACC8                      862
#define NCO1ACCH_NCO1ACC              863
#define NCO1ACC9                      864
#define NCO1ACC10                     865
#define NCO1ACC11                     866
#define NCO1ACC12                     867
#define NCO1ACC13                     868
#define NCO1ACC14                     869
#define NCO1ACC15                     870
#define NCO1ACCU                      871
#define NCO1ACCU_NCO1ACC              872
#define NCO1ACC16                     873
#define NCO1ACC17                     874
#define NCO1ACC18                     875
#define NCO1ACC19                     876
#define NCO1INCL                      877
#define NCO1INC0                      878
#define NCO1INCL_NCO1INC              879
#define NCO1INC1                      880
#define NCO1INC2                      881
#define NCO1INC3                      882
#define NCO1INC4                      883
#define NCO1INC5                      884
#define NCO1INC6                      885
#define NCO1INC7                      886
#define NCO1INCH                      887
#define NCO1INCH_NCO1INC              888
#define NCO1INC8                      889
#define NCO1INC9                      890
#define NCO1INC10                     891
#define NCO1INC11                     892
#define NCO1INC12                     893
#define NCO1INC13                     894
#define NCO1INC14                     895
#define NCO1INC15                     896
#define NCO1INCU                      897
#define NCO1INC16                     898
#define NCO1INCU_NCO1INC              899
#define NCO1INC17                     900
#define NCO1INC18                     901
#define NCO1INC19                     902
#define NCO1CON                       903
#define N1PFM                         904
#define N1POL                         905
#define N1OUT                         906
#define N1EN                          907
#define NCO1CLK                       908
#define N1CKS                         909
#define N1CKS0                        910
#define N1CKS1                        911
#define N1PWS0                        912
#define N1PWS                         913
#define N1PWS1                        914
#define N1PWS2                        915
#define OPA1CON                       916
#define OPA1PCH                       917
#define OPA1PCH0                      918
#define OPA1PCH1                      919
#define OPA1UG                        920
#define OPA1SP                        921
#define OPA1EN                        922
#define OPA2CON                       923
#define OPA2PCH                       924
#define OPA2PCH0                      925
#define OPA2PCH1                      926
#define OPA2UG                        927
#define OPA2SP                        928
#define OPA2EN                        929
#define PWM3DCL0                      930
#define PWM3DCL                       931
#define PWM3DCL1                      932
#define PWM3DCH0                      933
#define PWM3DCH                       934
#define PWM3DCH1                      935
#define PWM3DCH2                      936
#define PWM3DCH3                      937
#define PWM3DCH4                      938
#define PWM3DCH5                      939
#define PWM3DCH6                      940
#define PWM3DCH7                      941
#define PWM3CON                       942
#define PWM3POL                       943
#define PWM3OUT                       944
#define PWM3EN                        945
#define PWM4DCL                       946
#define PWM4DCL0                      947
#define PWM4DCL1                      948
#define PWM4DCH0                      949
#define PWM4DCH                       950
#define PWM4DCH1                      951
#define PWM4DCH2                      952
#define PWM4DCH3                      953
#define PWM4DCH4                      954
#define PWM4DCH5                      955
#define PWM4DCH6                      956
#define PWM4DCH7                      957
#define PWM4CON                       958
#define PWM4POL                       959
#define PWM4OUT                       960
#define PWM4EN                        961
#define COG1PHR                       962
#define G1PHR                         963
#define G1PHR0                        964
#define G1PHR1                        965
#define G1PHR2                        966
#define G1PHR3                        967
#define G1PHR4                        968
#define G1PHR5                        969
#define COG1PHF                       970
#define G1PHF0                        971
#define G1PHF                         972
#define G1PHF1                        973
#define G1PHF2                        974
#define G1PHF3                        975
#define G1PHF4                        976
#define G1PHF5                        977
#define COG1BLKR                      978
#define G1BLKR                        979
#define G1BLKR0                       980
#define G1BLKR1                       981
#define G1BLKR2                       982
#define G1BLKR3                       983
#define G1BLKR4                       984
#define G1BLKR5                       985
#define COG1BLKF                      986
#define G1BLKF                        987
#define G1BLKF0                       988
#define G1BLKF1                       989
#define G1BLKF2                       990
#define G1BLKF3                       991
#define G1BLKF4                       992
#define G1BLKF5                       993
#define COG1DBR                       994
#define G1DBR0                        995
#define G1DBR                         996
#define G1DBR1                        997
#define G1DBR2                        998
#define G1DBR3                        999
#define G1DBR4                        1000
#define G1DBR5                        1001
#define COG1DBF                       1002
#define G1DBF0                        1003
#define G1DBF                         1004
#define G1DBF1                        1005
#define G1DBF2                        1006
#define G1DBF3                        1007
#define G1DBF4                        1008
#define G1DBF5                        1009
#define COG1CON0                      1010
#define G1MD0                         1011
#define G1MD                          1012
#define G1MD1                         1013
#define G1MD2                         1014
#define G1CS0                         1015
#define G1CS                          1016
#define G1CS1                         1017
#define G1LD                          1018
#define G1EN                          1019
#define COG1CON1                      1020
#define G1POLA                        1021
#define G1POLB                        1022
#define G1POLC                        1023
#define G1POLD                        1024
#define G1FDBS                        1025
#define G1RDBS                        1026
#define COG1RIS                       1027
#define G1RIS0                        1028
#define G1RIS1                        1029
#define G1RIS2                        1030
#define G1RIS3                        1031
#define G1RIS4                        1032
#define G1RIS5                        1033
#define G1RIS6                        1034
#define G1RIS7                        1035
#define COG1RSIM                      1036
#define G1RSIM0                       1037
#define G1RSIM1                       1038
#define G1RSIM2                       1039
#define G1RSIM3                       1040
#define G1RSIM4                       1041
#define G1RSIM5                       1042
#define G1RSIM6                       1043
#define G1RSIM7                       1044
#define COG1FIS                       1045
#define G1FIS0                        1046
#define G1FIS1                        1047
#define G1FIS2                        1048
#define G1FIS3                        1049
#define G1FIS4                        1050
#define G1FIS5                        1051
#define G1FIS6                        1052
#define G1FIS7                        1053
#define COG1FSIM                      1054
#define G1FSIM0                       1055
#define G1FSIM1                       1056
#define G1FSIM2                       1057
#define G1FSIM3                       1058
#define G1FSIM4                       1059
#define G1FSIM5                       1060
#define G1FSIM6                       1061
#define G1FSIM7                       1062
#define COG1ASD0                      1063
#define G1ASDAC0                      1064
#define G1ASDAC                       1065
#define G1ASDAC1                      1066
#define G1ASDBD0                      1067
#define G1ASDBD                       1068
#define G1ASDBD1                      1069
#define G1ARSEN                       1070
#define G1ASE                         1071
#define COG1ASD1                      1072
#define G1AS0E                        1073
#define G1AS1E                        1074
#define G1AS2E                        1075
#define G1AS3E                        1076
#define COG1STR                       1077
#define G1STRA                        1078
#define G1STRB                        1079
#define G1STRC                        1080
#define G1STRD                        1081
#define G1SDATA                       1082
#define G1SDATB                       1083
#define G1SDATC                       1084
#define G1SDATD                       1085
#define PPSLOCK                       1086
#define PPSLOCKED                     1087
#define INTPPS                        1088
#define T0CKIPPS                      1089
#define T1CKIPPS                      1090
